###################################################################

# Created by write_sdc on Tue Dec 16 11:00:16 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_fanout 18 [current_design]
set_load -pin_load 7 [get_ports {mprj_io[37]}]
set_load -pin_load 7 [get_ports {mprj_io[36]}]
set_load -pin_load 7 [get_ports {mprj_io[35]}]
set_load -pin_load 7 [get_ports {mprj_io[34]}]
set_load -pin_load 7 [get_ports {mprj_io[33]}]
set_load -pin_load 7 [get_ports {mprj_io[32]}]
set_load -pin_load 7 [get_ports {mprj_io[31]}]
set_load -pin_load 7 [get_ports {mprj_io[30]}]
set_load -pin_load 7 [get_ports {mprj_io[29]}]
set_load -pin_load 7 [get_ports {mprj_io[28]}]
set_load -pin_load 7 [get_ports {mprj_io[27]}]
set_load -pin_load 7 [get_ports {mprj_io[26]}]
set_load -pin_load 7 [get_ports {mprj_io[25]}]
set_load -pin_load 7 [get_ports {mprj_io[24]}]
set_load -pin_load 7 [get_ports {mprj_io[23]}]
set_load -pin_load 7 [get_ports {mprj_io[22]}]
set_load -pin_load 7 [get_ports {mprj_io[21]}]
set_load -pin_load 7 [get_ports {mprj_io[20]}]
set_load -pin_load 7 [get_ports {mprj_io[19]}]
set_load -pin_load 7 [get_ports {mprj_io[18]}]
set_load -pin_load 7 [get_ports {mprj_io[17]}]
set_load -pin_load 7 [get_ports {mprj_io[16]}]
set_load -pin_load 7 [get_ports {mprj_io[15]}]
set_load -pin_load 7 [get_ports {mprj_io[14]}]
set_load -pin_load 7 [get_ports {mprj_io[13]}]
set_load -pin_load 7 [get_ports {mprj_io[12]}]
set_load -pin_load 7 [get_ports {mprj_io[11]}]
set_load -pin_load 7 [get_ports {mprj_io[10]}]
set_load -pin_load 7 [get_ports {mprj_io[9]}]
set_load -pin_load 7 [get_ports {mprj_io[8]}]
set_load -pin_load 7 [get_ports {mprj_io[7]}]
set_load -pin_load 7 [get_ports {mprj_io[6]}]
set_load -pin_load 7 [get_ports {mprj_io[5]}]
set_load -pin_load 7 [get_ports {mprj_io[4]}]
set_load -pin_load 7 [get_ports {mprj_io[3]}]
set_load -pin_load 7 [get_ports {mprj_io[2]}]
set_load -pin_load 7 [get_ports {mprj_io[1]}]
set_load -pin_load 7 [get_ports {mprj_io[0]}]
set_load -pin_load 7 [get_ports flash_csb]
set_load -pin_load 7 [get_ports flash_clk]
set_load -pin_load 7 [get_ports flash_io0]
set_load -min -pin_load 4 [get_ports {mprj_io[37]}]
set_load -min -pin_load 4 [get_ports {mprj_io[36]}]
set_load -min -pin_load 4 [get_ports {mprj_io[35]}]
set_load -min -pin_load 4 [get_ports {mprj_io[34]}]
set_load -min -pin_load 4 [get_ports {mprj_io[33]}]
set_load -min -pin_load 4 [get_ports {mprj_io[32]}]
set_load -min -pin_load 4 [get_ports {mprj_io[31]}]
set_load -min -pin_load 4 [get_ports {mprj_io[30]}]
set_load -min -pin_load 4 [get_ports {mprj_io[29]}]
set_load -min -pin_load 4 [get_ports {mprj_io[28]}]
set_load -min -pin_load 4 [get_ports {mprj_io[27]}]
set_load -min -pin_load 4 [get_ports {mprj_io[26]}]
set_load -min -pin_load 4 [get_ports {mprj_io[25]}]
set_load -min -pin_load 4 [get_ports {mprj_io[24]}]
set_load -min -pin_load 4 [get_ports {mprj_io[23]}]
set_load -min -pin_load 4 [get_ports {mprj_io[22]}]
set_load -min -pin_load 4 [get_ports {mprj_io[21]}]
set_load -min -pin_load 4 [get_ports {mprj_io[20]}]
set_load -min -pin_load 4 [get_ports {mprj_io[19]}]
set_load -min -pin_load 4 [get_ports {mprj_io[18]}]
set_load -min -pin_load 4 [get_ports {mprj_io[17]}]
set_load -min -pin_load 4 [get_ports {mprj_io[16]}]
set_load -min -pin_load 4 [get_ports {mprj_io[15]}]
set_load -min -pin_load 4 [get_ports {mprj_io[14]}]
set_load -min -pin_load 4 [get_ports {mprj_io[13]}]
set_load -min -pin_load 4 [get_ports {mprj_io[12]}]
set_load -min -pin_load 4 [get_ports {mprj_io[11]}]
set_load -min -pin_load 4 [get_ports {mprj_io[10]}]
set_load -min -pin_load 4 [get_ports {mprj_io[9]}]
set_load -min -pin_load 4 [get_ports {mprj_io[8]}]
set_load -min -pin_load 4 [get_ports {mprj_io[7]}]
set_load -min -pin_load 4 [get_ports {mprj_io[6]}]
set_load -min -pin_load 4 [get_ports {mprj_io[5]}]
set_load -min -pin_load 4 [get_ports {mprj_io[4]}]
set_load -min -pin_load 4 [get_ports {mprj_io[3]}]
set_load -min -pin_load 4 [get_ports {mprj_io[2]}]
set_load -min -pin_load 4 [get_ports {mprj_io[1]}]
set_load -min -pin_load 4 [get_ports {mprj_io[0]}]
set_load -min -pin_load 4 [get_ports flash_csb]
set_load -min -pin_load 4 [get_ports flash_clk]
set_load -min -pin_load 4 [get_ports flash_io0]
set_case_analysis 0 [get_ports {mprj_io[3]}]
set_timing_derate -late -net_delay  1.0375 
set_timing_derate -early -net_delay  0.9625 
set_timing_derate -late -cell_delay 1.0375 
set_timing_derate -early -cell_delay 0.9625 
create_clock [get_ports clock]  -name clk  -period 25  -waveform {0 12.5}
set_clock_uncertainty 0.1  [get_clocks clk]
set_propagated_clock [get_clocks clk]
create_clock [get_pins chip_core/housekeeping/serial_clock]  -name hk_serial_clk  -period 100  -waveform {0 50}
set_clock_uncertainty 0.1  [get_clocks hk_serial_clk]
set_propagated_clock [get_clocks hk_serial_clk]
create_clock [get_pins chip_core/housekeeping/serial_load]  -name hk_serial_load  -period 1000  -waveform {0 500}
set_clock_uncertainty 0.1  [get_clocks hk_serial_load]
set_propagated_clock [get_clocks hk_serial_load]
create_clock [get_ports {mprj_io[4]}]  -name hkspi_clk  -period 100  -waveform {0 50}
set_clock_uncertainty 0.1  [get_clocks hkspi_clk]
set_propagated_clock [get_clocks hkspi_clk]
set_false_path   -to [get_ports {mprj_io[0]}]
set_false_path   -to [get_ports {mprj_io[5]}]
set_false_path   -to [get_ports {mprj_io[6]}]
set_false_path   -to [get_ports {mprj_io[7]}]
set_false_path   -to [get_ports {mprj_io[8]}]
set_false_path   -to [get_ports {mprj_io[9]}]
set_false_path   -to [get_ports {mprj_io[10]}]
set_false_path   -to [get_ports {mprj_io[11]}]
set_false_path   -to [get_ports {mprj_io[12]}]
set_false_path   -to [get_ports {mprj_io[13]}]
set_false_path   -to [get_ports {mprj_io[14]}]
set_false_path   -to [get_ports {mprj_io[15]}]
set_false_path   -to [get_ports {mprj_io[16]}]
set_false_path   -to [get_ports {mprj_io[17]}]
set_false_path   -to [get_ports {mprj_io[18]}]
set_false_path   -to [get_ports {mprj_io[19]}]
set_false_path   -to [get_ports {mprj_io[20]}]
set_false_path   -to [get_ports {mprj_io[21]}]
set_false_path   -to [get_ports {mprj_io[22]}]
set_false_path   -to [get_ports {mprj_io[23]}]
set_false_path   -to [get_ports {mprj_io[24]}]
set_false_path   -to [get_ports {mprj_io[25]}]
set_false_path   -to [get_ports {mprj_io[26]}]
set_false_path   -to [get_ports {mprj_io[27]}]
set_false_path   -to [get_ports {mprj_io[28]}]
set_false_path   -to [get_ports {mprj_io[29]}]
set_false_path   -to [get_ports {mprj_io[30]}]
set_false_path   -to [get_ports {mprj_io[31]}]
set_false_path   -to [get_ports {mprj_io[32]}]
set_false_path   -to [get_ports {mprj_io[33]}]
set_false_path   -to [get_ports {mprj_io[34]}]
set_false_path   -to [get_ports {mprj_io[35]}]
set_false_path   -to [get_ports {mprj_io[36]}]
set_false_path   -to [get_ports {mprj_io[37]}]
set_false_path   -from [get_ports resetb]
set_false_path   -from [get_ports gpio]
set_input_delay -clock clk  4  [get_ports gpio]
set_input_delay -clock hkspi_clk  4  [get_ports {mprj_io[3]}]
set_input_delay -clock hkspi_clk  4  [get_ports {mprj_io[2]}]
set_input_delay -clock clk  4  [get_ports flash_io1]
set_output_delay -clock clk  4  [get_ports {mprj_io[0]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[5]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[6]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[7]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[8]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[9]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[10]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[11]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[12]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[13]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[14]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[15]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[16]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[17]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[18]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[19]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[20]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[21]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[22]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[23]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[24]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[25]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[26]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[27]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[28]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[29]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[30]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[31]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[32]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[33]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[34]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[35]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[36]}]
set_output_delay -clock clk  4  [get_ports {mprj_io[37]}]
set_output_delay -clock hkspi_clk  4  [get_ports {mprj_io[1]}]
set_output_delay -clock clk  4  [get_ports flash_csb]
set_output_delay -clock clk  4  [get_ports flash_clk]
set_output_delay -clock clk  4  [get_ports flash_io0]
set_clock_groups  -logically_exclusive -name clock_group  -group [get_clocks   \
clk] -group [get_clocks hk_serial_clk] -group [get_clocks hk_serial_load]      \
-group [get_clocks hkspi_clk]
set_input_transition -max 4  [get_ports gpio]
set_input_transition -min 1  [get_ports gpio]
set_input_transition -max 4  [get_ports {mprj_io[3]}]
set_input_transition -min 1  [get_ports {mprj_io[2]}]
set_input_transition -max 1.5  [get_ports clock]
set_input_transition -min 1  [get_ports clock]
set_input_transition -max 6  [get_ports flash_io1]
set_input_transition -min 4  [get_ports flash_io1]
